# GetSubelements Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Element..::..GetSubelements Method
Element Class See Also
---
Returns the collection of element subelements.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public IList<Subelement> GetSubelements()
```

Visual Basic
---
```text
Public Function GetSubelements As IList(Of Subelement)
```

Visual C++
---
```text
public:
IList<Subelement^>^ GetSubelements()
```

# ### Return Value
The collection of element subelements.
# Remarks
This collection will not include the Element itself.
# See Also
Element Class
Autodesk.Revit.DB Namespace